const characters = [
    {
    id: 79,
    name: "不死途",
    type: "雷",
    path: "巡猎",
    img:"images/不死途立绘.jpg",
    stats: {
      attack: Math.round(776.16),
      defense: Math.round(388.08),
      hp: Math.round(854),
      speed: Math.round(106)
    },
    desc: "随缘营业，硬核推理，全凭直觉却屡破奇案。"+
    "猴子当助手，一心盼退休，侦探睡在冰箱，只为等愿者上钩。"+
    "幻月下，恶兽长嗥，他的追猎游戏会如何收网？",
    skills: [
      { name: "普攻 - 利爪，授以礼仪", levelRange:[1,10],
        growth: {
            damage: [50, 140]       // 伤害比例（1级60%，10级120%）
        },
        desc: "对指定敌方单体造成等同于不死途{damage}%攻击力的雷属性伤害"
      },
      { name: "战技 - 鞭哨，逐尽恶兽", levelRange:[1,15],
        growth: {
            mainDamage: [100, 250], 
            subDamage: [50, 125],    // 速度提升比例（1级10%，15级25%）
            defDecrease: [20,50]
        },
        desc: "使指定敌方单体成为【饲饵】，对其造成不死途{mainDamage}%攻击力的雷属性伤害。"+
        "若该目标为【饲饵】，则额外对其造成等同于不死途{subDamage}%攻击力的雷属性伤害，并恢复1点战技点。"+
        "场上存在【饲饵】时，敌方全体防御力降低{defDecrease}%"+
        "场上不存在【饲饵】时，不死途立即使当前场上生命值最低的敌方单位目标成为【饲饵】，【饲饵】状态仅对最新被施加的目标生效"
      },
      { name: "终结技 - 飨宴，自始无终", levelRange:[1,15],
        growth: {
            mainDamage: [200, 500], 
            subDamage: [50, 125],    // 速度提升比例（1级10%，15级25%）
            defDecrease: [20,50]
        },
        desc: "使指定敌方单体成为【饲饵】，对其造成等同于不死途{mainDamage}%"+
        "攻击力的雷属性伤害，随后立即对【饲饵】发动1次获得强化的天赋追加攻击，"+
        "且不死途获得3点充能。强化天赋追加攻击不消耗充能，拥有【婪酣】时，"+
        "每消耗4层【婪酣】可额外造成1次等同于不死途{subDamage}%攻击力的雷属性伤害，"+
        "且本次追加攻击过程中对目标造成致命攻击时，对继续对新的【饲饵】造成伤害，"+
        "直至【婪酣】小于4层。若当前场上所有敌方目标都受到致命攻击后强化天赋的追加攻击会立即结束"
      },
      { name: "天赋 - 宿怨，切齿奉还", levelRange:[1, 15],
        growth:{
            mainDamage:[100, 250],
        },
        desc:"不死途初始拥有2点充能，最多拥有3点充能。【饲饵】受到我方其他目标攻击后不死途固定恢复8点能量，"+
        "随后消耗1点充能对【饲饵】发动追加攻击，造成等同于不死途{mainDamage}%攻击力的雷属性伤害"+
        "随后获得2层【婪酣】，最多叠加12层"
      }
    ]
  },

  {
    id: 78,
    name: "火花",
    type: "火",
    path: "欢愉",
    img: "images/火花立绘.jpg",
    stats: {
      attack: Math.round(61.2 + 5.0 * 79),
      defense: Math.round(85.4 + 3.6 * 79),
      hp: Math.round(162 + 34.1 * 79)
    },
    desc: "点赞！关注！直播！流量！狂欢直到世界尽头！"+
    "火花和花火，假面与愚者本无不同——"+
    "谁被看见，谁被喜欢，谁就是正确答案！",
    skills: [
      { name: "普攻 - 哑火了吗", levelRange:[1,10],
        growth: {
            damage: [50, 100]       // 伤害比例（1级50%，10级100%）
        },
        desc: "对指定敌方单体造成等同于火花{damage}%攻击力的火属性伤害（火球伤害）"
      },
      { name: "战技 - 尖叫！火花花连线中", levelRange:[1,15],
        growth: {
            fireballCount: [3, 5],  // 火球数量（1级3颗，15级5颗）
            damage: [40, 80]        // 单颗火球伤害比例（1级40%，15级80%）
        },
        desc: "发射{fireballCount}颗火球，沿直线对路径上敌方目标造成等同于火花{damage}%攻击力的火属性伤害（五颗火球直线输出）"
      },
      { name: "终结技 - 万我狂欢，镜头不要停", levelRange:[1,15],
        growth: {
            damage: [200, 400]      // 总伤害比例（1级200%，15级400%）
        },
        desc: "释放激光射线，对敌方全体造成等同于火花{damage}%攻击力的火属性伤害（激光射线，超高爆发）"
      },
      { name: "欢愉技 - 信号溢出：好戏返场！", levelRange:[1,15],
        growth: {
            totalDamage: [80, 160], // 全体基础伤害比例（1级80%，15级160%）
            singleDamage: [10, 20]  // 单次额外伤害比例（1级10%，15级20%）
        },
        desc: "对敌方全体造成等同于火花{totalDamage}%攻击力"+
        "的火属性欢愉伤害, 并额外造成20次伤害。每次伤害对随机敌方单体造成等同于火花{singleDamage}%攻击力"+
        "的火属性欢愉伤害。使火花获得2个【爆点】,可用来抵扣火花的战技点消耗。消耗【爆点】视为消耗战技点"
      }
    ]
  },
  {
    id: 77,
    name: "爻光",
    type: "物理",
    path: "欢愉",
    img: "images/爻光立绘.jpg",
    stats: {
      attack: Math.round(465.7), // 80级攻击力
      defense: Math.round(654.88), // 80级防御力
      hp: Math.round(1242) // 80级生命值
    },
    desc: "神秘，大胆，激进，求变之举令人瞠目结舌。"+
    "以巡猎之「眼」遍观吉凶，明知天意难违，「戎韬将军」仍旧孤身涉险。"+
    "这一支下下签，如何能够改运换天？",
    skills: [
      { name: "普攻 - 雀翎鸣镝，过招有喜", 
        levelRange:[1,10],
        growth:{
            mainDamage:[45,126],
            adjacentDamage:[15,42]
        },
        desc: "对指定敌方单体造成等同于爻光{mainDamage}%"+
        "攻击力的物理属性伤害，同时对其相邻目标造成等同于爻光{adjacentDamage}%"+
        "攻击力的物理属性伤害。普攻恢复的能量提高至30点"
       },
      { name: "战技 - 十方光映，万法皆明", levelRange:[1,15],
        growth: {
            joyBoost: [10, 25]      // 欢愉度提高比例（1级10%，15级30%）
        },
        desc: "展开结界，持续3回合, 自身每回合开始时结界持续回合数减1。结界持续期间, "+
        "我方全体目标欢愉度提高，提高数值等同于爻光欢愉度的{joyBoost}%"+
        "，且爻光施放普攻、战技后获得笑点"
       },
      { name: "终结技 - 霓裳铁羽，六爻皆吉", levelRange:[1,15], 
        growth: {
            penetration: [10, 25]   // 全属性抗性穿透（1级10%，15级25%）
        },
        desc: "获得5个笑点。使阿哈立即获得1个固定计入20笑点的额外回合，该回合不消耗笑点，"+
        "并使我方全体目标全属性抗性穿透提高{penetration}%"+
        ", 持续3回合"
       },
       {name: "天赋 - 屏开千光，遍观自在", levelRange:[1,15],
        growth:{
        joydamage: [10, 25] //欢愉伤害倍率 1级 10，15级25
        },
        desc:"爻光持有【好活当赏】时:<br/>"+"使我方目标施放攻击后触发【大吉大利】效果，"+
        "对随机1个击中的目标额外造成1次{joydamage}%的对应属性的欢愉伤害，本次攻击若消耗战技点，"+
        "则额外触发1次【大吉大利】效果。触发【大吉大利】效果时若攻击者欢愉度低于爻光，则该次"+
        "欢愉伤害使用爻光欢愉度来计算。触发【大吉大利】效果不视为1次攻击。"
       }
    ]
  },
];