const characters4 = [
  {
    id: 80,
    name: "绯英",
    type: "物理",
    path: "欢愉",
    img: "images/绯英立绘.jpg",
     stats: {
      attack: Math.round(), 
      defense: Math.round(), 
      hp: Math.round(), 
      speed: Math.round()
    },
    desc: "",
    skills: [
      { name: "普攻 - ", levelRange:[1,10],
        growth:{
        },
        desc: ""
       },
      { name: "战技 - ", levelRange:[1,15],
        growth: {
        },
        desc: ""
       },
      { name: "终结技 - ", levelRange:[1,15], 
        growth: {
        },
        desc: ""
       },
       {name: "天赋 - ", levelRange:[1,15],
        growth:{
        },
        desc:""
       }
    ]
  },
  {
    id: 80,
    name: "银狼LV.999",
    type: "虚数",
    path: "欢愉",
    img: "images/银狼999立绘.jpg",
    stats: {
      attack: Math.round(), 
      defense: Math.round(), 
      hp: Math.round(), 
      speed: Math.round()
    },
    desc: "",
    skills: [
      { name: "普攻 - ", levelRange:[1,10],
        growth:{
        },
        desc: ""
       },
      { name: "战技 - ", levelRange:[1,15],
        growth: {
        },
        desc: ""
       },
      { name: "终结技 - ", levelRange:[1,15], 
        growth: {
        },
        desc: ""
       },
       {name: "天赋 - ", levelRange:[1,15],
        growth:{
        },
        desc:""
       }
    ]
  },
    {
    id: 79,
    name: "不死途",
    type: "雷",
    path: "巡猎",
    img:"images/不死途/不死途立绘.jpg",
    stats: {
      attack: Math.round(776.16),
      defense: Math.round(388.08),
      hp: Math.round(854),
      speed: Math.round(106)
    },
    desc: "随缘营业，硬核推理，全凭直觉却屡破奇案。"+
    "猴子当助手，一心盼退休，侦探睡在冰箱，只为等愿者上钩。"+
    "幻月下，恶兽长嗥，他的追猎游戏会如何收网？",
    skills: [
      { name: "普攻 - 利爪，授以礼仪", levelRange:[1,10],
        growth: {
            damage: [50, 140]       // 伤害比例（1级60%，10级120%）
        },
        simpleDesc: "对单体造成雷属性伤害",
        desc: "对指定敌方单体造成等同于不死途{damage}%攻击力的雷属性伤害"
      },
      { name: "战技 - 鞭哨，逐尽恶兽", levelRange:[1,15],
        growth: {
            mainDamage: [100, 250], 
            subDamage: [50, 125],    // 速度提升比例（1级10%，15级25%）
            defDecrease: [20,50]
        },
        simpleDesc: "使指定敌方单体成为【饲饵】，对其造成大量雷属性伤害，若该目标为【饲饵】，则额外对其造成少量雷属性伤害并恢复1点战技点。"+
        "场上存在【饲饵】时，敌方全体防御力降低。",
        desc: "使指定敌方单体成为【饲饵】，对其造成不死途{mainDamage}%攻击力的雷属性伤害。"+
        "若该目标为【饲饵】，则额外对其造成等同于不死途{subDamage}%攻击力的雷属性伤害，并恢复1点战技点。"+
        "场上存在【饲饵】时，敌方全体防御力降低{defDecrease}%"+
        "场上不存在【饲饵】时，不死途立即使当前场上生命值最低的敌方单位目标成为【饲饵】，【饲饵】状态仅对最新被施加的目标生效"
      },
      { name: "终结技 - 飨宴，自始无终", levelRange:[1,15],
        growth: {
            mainDamage: [200, 500], 
            subDamage: [50, 125],    // 速度提升比例（1级10%，15级25%）
            defDecrease: [20,50]
        },
        simpleDesc: "使指定敌方单体成为【饲饵】，对其造成大量雷属性伤害，随后立即对【饲饵】发动1次获得强化的天赋追加攻击，"+
        "且不死徒获得充能强化天赋追加攻击不消耗充能，拥有【婪酣】时，每消耗4层【婪酣】可额外造成大量雷属性伤害，"+
        "且本次追加攻击场上存在【饲饵】时对目标造成致命攻击时，对继续对新的【饲饵】造成伤害，直至【婪酣】小于4层。",
        desc: "使指定敌方单体成为【饲饵】，对其造成等同于不死途{mainDamage}%"+
        "攻击力的雷属性伤害，随后立即对【饲饵】发动1次获得强化的天赋追加攻击，"+
        "且不死途获得3点充能。强化天赋追加攻击不消耗充能，拥有【婪酣】时，"+
        "每消耗4层【婪酣】可额外造成1次等同于不死途{subDamage}%攻击力的雷属性伤害，"+
        "且本次追加攻击过程中对目标造成致命攻击时，对继续对新的【饲饵】造成伤害，"+
        "直至【婪酣】小于4层。若当前场上所有敌方目标都受到致命攻击后强化天赋的追加攻击会立即结束"
      },
      { name: "天赋 - 宿怨，切齿奉还", levelRange:[1, 15],
        growth:{
            mainDamage:[100, 250],
        },
        simpleDesc:"【饲饵】收到我方其他目标攻击后，不死途固定回复能量，随后会消耗充能对【饲饵】发动追加攻击，"+
        "造成大量雷属性伤害，随后获得2层【婪酣】",
        desc:"不死途初始拥有2点充能，最多拥有3点充能。【饲饵】受到我方其他目标攻击后不死途固定恢复8点能量，"+
        "随后消耗1点充能对【饲饵】发动追加攻击，造成等同于不死途{mainDamage}%攻击力的雷属性伤害"+
        "随后获得2层【婪酣】，最多叠加12层"
      }
    ],
    traces: [
        { name:"罪途",
        desc:"不死途施放战技/终结技时，获得1/2层【婪酣】。不死途追加攻击过程中每有1个敌人受到致命攻击时，不死途获得1层【婪酣】。"},
        { name: "影肢",
            desc: "不死途追加攻击造成的伤害提高80%，且每有1层【婪酣】，追加攻击造成的伤害额外提高10%。",
        },
        { name:"头狼",
            desc:"不死途在场时，我方目标造成的暴击伤害提高40%，我方目标追加攻击造成的暴击伤害额外提高80%。"
        }
    ],
      // 新增：6个星魂（图片路径替换成你的实际路径，描述可修改）
    constellation: [
    {
      img: "images/不死途/不死途星魂1.webp", 
      name: "小心，满月不可外出",
      desc: "不死途在场时，敌方全体受到的伤害提高24%。当敌方目标当前生命值百分比小于等于50%时，其受到的伤害提高至36%。"
    },
    {
      img: "images/不死途/不死途星魂2.webp",
      name: "敲门，屋内空余窃笑",
      desc: "婪酣】叠加上限提高至18层，每当不死途发动强化天赋追加攻击后，返还所移除【婪酣】层数的35%。"
    },
    {
      img: "images/不死途/不死途星魂3.webp",
      name: "沉默，老友各怀心事",
      desc: "终结技等级+2，最多不超过15级；普攻等级+1，最多不超过10级。"
    },
    {
      img: "images/不死途/不死途星魂4.webp",
      name: "切记，不必咀嚼真相",
      desc: "不死途施放终结技时，攻击力提高40%，持续3回合。"
    },
    {
      img: "images/不死途/不死途星魂5.webp",
      name: "提醒，侦探亦是凶手",
      desc: "战技等级+2，最多不超过15级；天赋等级+2，最多不超过15级。"
    },
    {
      img: "images/不死途/不死途星魂6.webp",
      name: "结局，或许无人生还",
      desc: "当场上存在【饲饵】时，敌方全体的全属性抗性降低20%。不死途每获得过1层【婪酣】，造成的伤害提高4%，该效果最多叠加30层。"
    }
  ]
  },

  {
    id: 78,
    name: "火花",
    type: "火",
    path: "欢愉",
    img: "images/火花立绘.jpg",
    stats: {
      attack: Math.round(640.33),
      defense: Math.round(460.85),
      hp: Math.round(1048),
      speed: 107
    },
    desc: "点赞！关注！直播！流量！狂欢直到世界尽头！"+
    "火花和花火，假面与愚者本无不同——"+
    "谁被看见，谁被喜欢，谁就是正确答案！",
    skills: [
      { name: "普攻 - 哑火了吗", levelRange:[1,10],
        growth: {
          damage: [50, 140]       
        },
        desc: "对指定敌方单体造成等同于火花{damage}%攻击力的火属性伤害"
      },
      { name: "强化普攻 - 百花齐放，胜者独享！", levelRange:[1,10],
        growth:{
          mainDamage:[50, 140],
          subDamage:[25, 70]
        },
        desc: "结算直播连线结果，对指定敌方单体造成等同于火花{mainDamage}%攻击力的火属性伤害，"+
        "并对其相邻目标造成等同于火花{subDamage}%攻击力的火属性伤害。"
      },
      { name: "战技 - 尖叫！火花花连线中", levelRange:[1,15],
        growth:{},
        desc: "开启直播连线，使普通攻击变为【百花齐放，胜者独享！】并发动一次【互动陷阱】，"+
        "本次技能内可以重复发动【互动陷阱】, 最多发动20次。释放本技能不视为使用战技。"
      },
      { name: "特殊战技 - 互动陷阱", levelRange:[1,15],
        growth: {
            mainDamage: [10, 25],  
            subDamage: [5, 12.5]
        },
        desc: "使【百花齐放，胜者独享！】对指定敌方单体的伤害倍率提高{mainDamage}%, "+
        "对其相邻目标的伤害倍率提高{subDamage}%，并随机获得一种礼物--<br/>"+
        "【红红火火】: 2个笑点和2个战技点。<br/>【轰轰轰轰】: 1个笑点。<br/>释放本技能不视为使用战技"
      },
      { name: "终结技 - 万我狂欢，镜头不要停", levelRange:[1,15],
        growth: {
            damage: [30, 60]      
        },
        desc: "获得2个笑点。对敌方全体造成等同于火花(0.6*欢愉度+30)%攻击力的火属性伤害。"
      },
      { name: "天赋 - 幕后花手", levelRange:[1,15],
        growth: {
            mainDamage:[20,50],
            subDamage:[10,25],
            singleDamage:[10,25],
            areaDamage:[24,60],
        },
        desc: "火花持有【好活当赏】时：<br/>"+
        "发动强化普通攻击可对指定敌方单体造成{mainDamage}%的火属性欢愉伤害，并对其相邻目标造成{subDamage}%的火属性欢愉伤害。"+
        "且每发动1次【互动陷阱】便会使强化普通攻击额外对随机一个收到攻击的敌方目标造成1次{singleDamage}%的火属性欢愉伤害。"+
        "<br/>释放终结技可对敌方全体造成{areaDamage}%的火属性欢愉伤害"

      },
      { name: "欢愉技 - 信号溢出：好戏返场！", levelRange:[1,15],
        growth: {
            areaDamage: [25, 62.5], 
            singleDamage: [12.5, 31.25]  
        },
        desc: "对敌方全体造成等同于火花{areaDamage}%的的火属性欢愉伤害, 并额外造成20次伤害。"+
        "每次伤害对随机敌方单体造成等同于火花{singleDamage}%攻击力的火属性欢愉伤害。"+
        "使火花获得2个【爆点】,可用来抵扣火花的战技点消耗。消耗【爆点】视为消耗战技点"
      }
    ]
  },

  {
    id: 77,
    name: "爻光",
    type: "物理",
    path: "欢愉",
    img: "images/爻光立绘.jpg",
    stats: {
      attack: Math.round(465.7), // 80级攻击力
      defense: Math.round(654.88), // 80级防御力
      hp: Math.round(1242), // 80级生命值
      speed: 101
    },
    desc: "神秘，大胆，激进，求变之举令人瞠目结舌。"+
    "以巡猎之「眼」遍观吉凶，明知天意难违，「戎韬将军」仍旧孤身涉险。"+
    "这一支下下签，如何能够改运换天？",
    skills: [
      { name: "普攻 - 雀翎鸣镝，过招有喜", 
        levelRange:[1,10],
        growth:{
            mainDamage:[45,126],
            adjacentDamage:[15,42]
        },
        desc: "对指定敌方单体造成等同于爻光{mainDamage}%"+
        "攻击力的物理属性伤害，同时对其相邻目标造成等同于爻光{adjacentDamage}%"+
        "攻击力的物理属性伤害。普攻恢复的能量提高至30点"
       },
      { name: "战技 - 十方光映，万法皆明", levelRange:[1,15],
        growth: {
            joyBoost: [10, 25]      // 欢愉度提高比例（1级10%，15级30%）
        },
        desc: "展开结界，持续3回合, 自身每回合开始时结界持续回合数减1。结界持续期间, "+
        "我方全体目标欢愉度提高，提高数值等同于爻光欢愉度的{joyBoost}%"+
        "，且爻光施放普攻、战技后获得笑点"
       },
      { name: "终结技 - 霓裳铁羽，六爻皆吉", levelRange:[1,15], 
        growth: {
            penetration: [10, 25]   // 全属性抗性穿透（1级10%，15级25%）
        },
        desc: "获得5个笑点。使阿哈立即获得1个固定计入20笑点的额外回合，该回合不消耗笑点，"+
        "并使我方全体目标全属性抗性穿透提高{penetration}%"+
        ", 持续3回合"
       },
       {name: "天赋 - 屏开千光，遍观自在", levelRange:[1,15],
        growth:{
        joydamage: [10, 25] //欢愉伤害倍率 1级 10，15级25
        },
        desc:"爻光持有【好活当赏】时:<br/>"+"使我方目标施放攻击后触发【大吉大利】效果，"+
        "对随机1个击中的目标额外造成1次{joydamage}%的对应属性的欢愉伤害，本次攻击若消耗战技点，"+
        "则额外触发1次【大吉大利】效果。触发【大吉大利】效果时若攻击者欢愉度低于爻光，则该次"+
        "欢愉伤害使用爻光欢愉度来计算。触发【大吉大利】效果不视为1次攻击。"
       }
    ]
  },
];